from cnc import convert

chineseNumber = [
    ["零", "0"],
    ["一", "1"],
    ["十", "10"],
    ["十二", "12"],
    ["一百", "100"],
    ["一百一", "101"],
    ["兩百零二", "202"],
    ["三零五", "305"],
    ["九百九十三", "993"],
    ["一千", "1000"],
    ["一千零一", "1001"],
    ["二零一二", "2012"],
    ["四千五", "4005"],
    ["一萬", "10000"],
    ["一萬零五百", "10500"],
    ["十萬一", "100001"],
    ["十萬零一", "100001"],
    ["12萬9000", "129000"],
    ["三百萬", "3000000"],
    ["三百一十三萬零四十", "3130040"],
    ["九八七萬零五百", "9870500"],
    ["四千零五萬七千八百零九", "40057809"],
    ["五百零七萬四千", "5074000"],
    ["六千零三萬", "60030000"],
    ["九千三百零七萬五十", "93070050"],
    ["一億一萬一千零三", "100011003"],
    ["九億三千零五十六", "900003056"],
    ["三百零五億零五百零二", "30500000502"],
    ["一兆零一十六", "1000000000016"],
    ["十兆三千億五十七萬零九", "10300000570009"],
    ["一千零七十六兆五百億四千零七十二萬三千五百一十二", "1076050040723512"],
    ["5000億4321萬987", "500043210987"],
    ["四千兆零三", "4000000000000003"]
]

for s in chineseNumber:
    r = convert.chinese2number(s[0])
    if r != int(s[1]):
        print(s[0], "/", str(r))

print(convert.chinese2number("五十七"))